/* automatically generated by rust-bindgen */

pub const WGPU_WHOLE_SIZE: i32 = -1;
pub type WGPUFlags = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupImpl {
    _unused: [u8; 0],
}
pub type WGPUBindGroup = *mut WGPUBindGroupImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutImpl {
    _unused: [u8; 0],
}
pub type WGPUBindGroupLayout = *mut WGPUBindGroupLayoutImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferImpl {
    _unused: [u8; 0],
}
pub type WGPUBuffer = *mut WGPUBufferImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandBufferImpl {
    _unused: [u8; 0],
}
pub type WGPUCommandBuffer = *mut WGPUCommandBufferImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandEncoderImpl {
    _unused: [u8; 0],
}
pub type WGPUCommandEncoder = *mut WGPUCommandEncoderImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputePassEncoderImpl {
    _unused: [u8; 0],
}
pub type WGPUComputePassEncoder = *mut WGPUComputePassEncoderImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputePipelineImpl {
    _unused: [u8; 0],
}
pub type WGPUComputePipeline = *mut WGPUComputePipelineImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDeviceImpl {
    _unused: [u8; 0],
}
pub type WGPUDevice = *mut WGPUDeviceImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUFenceImpl {
    _unused: [u8; 0],
}
pub type WGPUFence = *mut WGPUFenceImpl;
#[repr(C)]

pub const WGPUVertexFormat_Float4: WGPUVertexFormat = 21;
pub const WGPUVertexFormat_UInt: WGPUVertexFormat = 22;
pub const WGPUVertexFormat_UInt2: WGPUVertexFormat = 23;
pub const WGPUVertexFormat_UInt3: WGPUVertexFormat = 24;
pub const WGPUVertexFormat_UInt4: WGPUVertexFormat = 25;
pub const WGPUVertexFormat_Int: WGPUVertexFormat = 26;
pub const WGPUVertexFormat_Int2: WGPUVertexFormat = 27;
pub const WGPUVertexFormat_Int3: WGPUVertexFormat = 28;
pub const WGPUVertexFormat_Int4: WGPUVertexFormat = 29;
pub const WGPUVertexFormat_Force32: WGPUVertexFormat = 2147483647;
pub type WGPUVertexFormat = i32;
pub const WGPUBufferUsage_None: WGPUBufferUsage = 0;
pub const WGPUBufferUsage_MapRead: WGPUBufferUsage = 1;
pub const WGPUBufferUsage_MapWrite: WGPUBufferUsage = 2;
pub const WGPUBufferUsage_CopySrc: WGPUBufferUsage = 4;
pub const WGPUBufferUsage_CopyDst: WGPUBufferUsage = 8;
pub const WGPUBufferUsage_Index: WGPUBufferUsage = 16;
pub const WGPUBufferUsage_Vertex: WGPUBufferUsage = 32;
pub const WGPUBufferUsage_Uniform: WGPUBufferUsage = 64;
pub const WGPUBufferUsage_Storage: WGPUBufferUsage = 128;
pub const WGPUBufferUsage_Indirect: WGPUBufferUsage = 256;
pub const WGPUBufferUsage_Force32: WGPUBufferUsage = 2147483647;
pub type WGPUBufferUsage = i32;
pub type WGPUBufferUsageFlags = WGPUFlags;
pub const WGPUColorWriteMask_None: WGPUColorWriteMask = 0;
pub const WGPUColorWriteMask_Red: WGPUColorWriteMask = 1;
pub const WGPUColorWriteMask_Green: WGPUColorWriteMask = 2;
pub const WGPUColorWriteMask_Blue: WGPUColorWriteMask = 4;
pub const WGPUColorWriteMask_Alpha: WGPUColorWriteMask = 8;
pub const WGPUColorWriteMask_All: WGPUColorWriteMask = 15;
pub const WGPUColorWriteMask_Force32: WGPUColorWriteMask = 2147483647;
pub type WGPUColorWriteMask = i32;
pub type WGPUColorWriteMaskFlags = WGPUFlags;
pub const WGPUShaderStage_None: WGPUShaderStage = 0;
pub const WGPUShaderStage_Vertex: WGPUShaderStage = 1;
pub const WGPUShaderStage_Fragment: WGPUShaderStage = 2;
pub const WGPUShaderStage_Compute: WGPUShaderStage = 4;
pub const WGPUShaderStage_Force32: WGPUShaderStage = 2147483647;
pub type WGPUShaderStage = i32;
pub type WGPUShaderStageFlags = WGPUFlags;
pub const WGPUTextureUsage_None: WGPUTextureUsage = 0;
pub const WGPUTextureUsage_CopySrc: WGPUTextureUsage = 1;
pub const WGPUTextureUsage_CopyDst: WGPUTextureUsage = 2;
pub const WGPUTextureUsage_Sampled: WGPUTextureUsage = 4;
pub const WGPUTextureUsage_Storage: WGPUTextureUsage = 8;
pub const WGPUTextureUsage_OutputAttachment: WGPUTextureUsage = 16;
pub const WGPUTextureUsage_Present: WGPUTextureUsage = 32;
pub const WGPUTextureUsage_Force32: WGPUTextureUsage = 2147483647;
pub type WGPUTextureUsage = i32;
pub type WGPUTextureUsageFlags = WGPUFlags;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUChainedStruct {
    pub next: *const WGPUChainedStruct,
    pub sType: WGPUSType,
}
#[test]
fn bindgen_test_layout_WGPUChainedStruct() {
    assert_eq!(
        ::core::mem::size_of::<WGPUChainedStruct>(),
        16usize,
        concat!("Size of: ", stringify!(WGPUChainedStruct))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUChainedStruct>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUChainedStruct))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUChainedStruct>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUChainedStruct),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUChainedStruct>())).sType as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUChainedStruct),
            "::",
            stringify!(sType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUAdapterProperties {
    pub nextInChain: *const WGPUChainedStruct,
    pub deviceID: u32,
    pub vendorID: u32,
    pub name: *const libc::c_char,
    pub adapterType: WGPUAdapterType,
    pub backendType: WGPUBackendType,
}
#[test]
fn bindgen_test_layout_WGPUAdapterProperties() {
    assert_eq!(
        ::core::mem::size_of::<WGPUAdapterProperties>(),
        32usize,
        concat!("Size of: ", stringify!(WGPUAdapterProperties))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUAdapterProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUAdapterProperties))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUAdapterProperties>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUAdapterProperties),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUAdapterProperties>())).deviceID as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUAdapterProperties),
            "::",
            stringify!(deviceID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUAdapterProperties>())).vendorID as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUAdapterProperties),
            "::",
            stringify!(vendorID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUAdapterProperties>())).name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUAdapterProperties),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUAdapterProperties>())).adapterType as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUAdapterProperties),
            "::",
            stringify!(adapterType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUAdapterProperties>())).backendType as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUAdapterProperties),
            "::",
            stringify!(backendType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupEntry {
    pub binding: u32,
    pub buffer: WGPUBuffer,
    pub offset: u64,
    pub size: u64,
    pub sampler: WGPUSampler,
    pub textureView: WGPUTextureView,
}
#[test]
fn bindgen_test_layout_WGPUBindGroupEntry() {
    assert_eq!(
        ::core::mem::size_of::<WGPUBindGroupEntry>(),
        48usize,
        concat!("Size of: ", stringify!(WGPUBindGroupEntry))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUBindGroupEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUBindGroupEntry))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupEntry>())).binding as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupEntry),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupEntry>())).buffer as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupEntry),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupEntry>())).offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupEntry),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupEntry>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupEntry),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupEntry>())).sampler as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupEntry),
            "::",
            stringify!(sampler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupEntry>())).textureView as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupEntry),
            "::",
            stringify!(textureView)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutEntry {
    pub binding: u32,
    pub visibility: WGPUShaderStageFlags,
    pub type_: WGPUBindingType,
    pub hasDynamicOffset: bool,
    pub multisampled: bool,
    pub textureDimension: WGPUTextureViewDimension,
    pub textureComponentType: WGPUTextureComponentType,
    pub storageTextureFormat: WGPUTextureFormat,
}
#[test]
fn bindgen_test_layout_WGPUBindGroupLayoutEntry() {
    assert_eq!(
        ::core::mem::size_of::<WGPUBindGroupLayoutEntry>(),
        28usize,
        concat!("Size of: ", stringify!(WGPUBindGroupLayoutEntry))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUBindGroupLayoutEntry>(),
        4usize,
        concat!("Alignment of ", stringify!(WGPUBindGroupLayoutEntry))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutEntry>())).binding as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutEntry),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutEntry>())).visibility as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutEntry),
            "::",
            stringify!(visibility)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupLayoutEntry>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutEntry),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutEntry>())).hasDynamicOffset as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutEntry),
            "::",
            stringify!(hasDynamicOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutEntry>())).multisampled as *const _ as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutEntry),
            "::",
            stringify!(multisampled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutEntry>())).textureDimension as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutEntry),
            "::",
            stringify!(textureDimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutEntry>())).textureComponentType as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutEntry),
            "::",
            stringify!(textureComponentType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutEntry>())).storageTextureFormat as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutEntry),
            "::",
            stringify!(storageTextureFormat)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBlendDescriptor {
    pub operation: WGPUBlendOperation,
    pub srcFactor: WGPUBlendFactor,
    pub dstFactor: WGPUBlendFactor,
}
#[test]
fn bindgen_test_layout_WGPUBlendDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUBlendDescriptor>(),
        12usize,
        concat!("Size of: ", stringify!(WGPUBlendDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUBlendDescriptor>(),
        4usize,
        concat!("Alignment of ", stringify!(WGPUBlendDescriptor))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBlendDescriptor>())).operation as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBlendDescriptor),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBlendDescriptor>())).srcFactor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBlendDescriptor),
            "::",
            stringify!(srcFactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBlendDescriptor>())).dstFactor as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBlendDescriptor),
            "::",
            stringify!(dstFactor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferCopyView {
    pub nextInChain: *const WGPUChainedStruct,
    pub buffer: WGPUBuffer,
    pub offset: u64,
    pub rowPitch: u32,
    pub imageHeight: u32,
}
#[test]
fn bindgen_test_layout_WGPUBufferCopyView() {
    assert_eq!(
        ::core::mem::size_of::<WGPUBufferCopyView>(),
        32usize,
        concat!("Size of: ", stringify!(WGPUBufferCopyView))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUBufferCopyView>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUBufferCopyView))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBufferCopyView>())).nextInChain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferCopyView),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBufferCopyView>())).buffer as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferCopyView),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBufferCopyView>())).offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferCopyView),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBufferCopyView>())).rowPitch as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferCopyView),
            "::",
            stringify!(rowPitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBufferCopyView>())).imageHeight as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferCopyView),
            "::",
            stringify!(imageHeight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBufferDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub usage: WGPUBufferUsageFlags,
    pub size: u64,
}
#[test]
fn bindgen_test_layout_WGPUBufferDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUBufferDescriptor>(),
        32usize,
        concat!("Size of: ", stringify!(WGPUBufferDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUBufferDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUBufferDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBufferDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBufferDescriptor>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBufferDescriptor>())).usage as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferDescriptor),
            "::",
            stringify!(usage)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBufferDescriptor>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBufferDescriptor),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUColor {
    pub r: f32,
    pub g: f32,
    pub b: f32,
    pub a: f32,
}
#[test]
fn bindgen_test_layout_WGPUColor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUColor>(),
        16usize,
        concat!("Size of: ", stringify!(WGPUColor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUColor>(),
        4usize,
        concat!("Alignment of ", stringify!(WGPUColor))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUColor>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColor),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUColor>())).g as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColor),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUColor>())).b as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColor),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUColor>())).a as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColor),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandBufferDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
}
#[test]
fn bindgen_test_layout_WGPUCommandBufferDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUCommandBufferDescriptor>(),
        16usize,
        concat!("Size of: ", stringify!(WGPUCommandBufferDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUCommandBufferDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUCommandBufferDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUCommandBufferDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUCommandBufferDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUCommandBufferDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUCommandBufferDescriptor),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCommandEncoderDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
}
#[test]
fn bindgen_test_layout_WGPUCommandEncoderDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUCommandEncoderDescriptor>(),
        16usize,
        concat!("Size of: ", stringify!(WGPUCommandEncoderDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUCommandEncoderDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUCommandEncoderDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUCommandEncoderDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUCommandEncoderDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUCommandEncoderDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUCommandEncoderDescriptor),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputePassDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
}
#[test]
fn bindgen_test_layout_WGPUComputePassDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUComputePassDescriptor>(),
        16usize,
        concat!("Size of: ", stringify!(WGPUComputePassDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUComputePassDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUComputePassDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUComputePassDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUComputePassDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUComputePassDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUComputePassDescriptor),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUCreateBufferMappedResult {
    pub buffer: WGPUBuffer,
    pub dataLength: u64,
    pub data: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_WGPUCreateBufferMappedResult() {
    assert_eq!(
        ::core::mem::size_of::<WGPUCreateBufferMappedResult>(),
        24usize,
        concat!("Size of: ", stringify!(WGPUCreateBufferMappedResult))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUCreateBufferMappedResult>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUCreateBufferMappedResult))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUCreateBufferMappedResult>())).buffer as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUCreateBufferMappedResult),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUCreateBufferMappedResult>())).dataLength as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUCreateBufferMappedResult),
            "::",
            stringify!(dataLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUCreateBufferMappedResult>())).data as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUCreateBufferMappedResult),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDeviceProperties {
    pub textureCompressionBC: bool,
}
#[test]
fn bindgen_test_layout_WGPUDeviceProperties() {
    assert_eq!(
        ::core::mem::size_of::<WGPUDeviceProperties>(),
        1usize,
        concat!("Size of: ", stringify!(WGPUDeviceProperties))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUDeviceProperties>(),
        1usize,
        concat!("Alignment of ", stringify!(WGPUDeviceProperties))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDeviceProperties>())).textureCompressionBC as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDeviceProperties),
            "::",
            stringify!(textureCompressionBC)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUExtent3D {
    pub width: u32,
    pub height: u32,
    pub depth: u32,
}
#[test]
fn bindgen_test_layout_WGPUExtent3D() {
    assert_eq!(
        ::core::mem::size_of::<WGPUExtent3D>(),
        12usize,
        concat!("Size of: ", stringify!(WGPUExtent3D))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUExtent3D>(),
        4usize,
        concat!("Alignment of ", stringify!(WGPUExtent3D))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUExtent3D>())).width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUExtent3D),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUExtent3D>())).height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUExtent3D),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUExtent3D>())).depth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUExtent3D),
            "::",
            stringify!(depth)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUFenceDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub initialValue: u64,
}
#[test]
fn bindgen_test_layout_WGPUFenceDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUFenceDescriptor>(),
        24usize,
        concat!("Size of: ", stringify!(WGPUFenceDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUFenceDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUFenceDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUFenceDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUFenceDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUFenceDescriptor>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUFenceDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUFenceDescriptor>())).initialValue as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUFenceDescriptor),
            "::",
            stringify!(initialValue)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUInstanceDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
}
#[test]
fn bindgen_test_layout_WGPUInstanceDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUInstanceDescriptor>(),
        8usize,
        concat!("Size of: ", stringify!(WGPUInstanceDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUInstanceDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUInstanceDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUInstanceDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUInstanceDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUOrigin3D {
    pub x: u32,
    pub y: u32,
    pub z: u32,
}
#[test]
fn bindgen_test_layout_WGPUOrigin3D() {
    assert_eq!(
        ::core::mem::size_of::<WGPUOrigin3D>(),
        12usize,
        concat!("Size of: ", stringify!(WGPUOrigin3D))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUOrigin3D>(),
        4usize,
        concat!("Alignment of ", stringify!(WGPUOrigin3D))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUOrigin3D>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUOrigin3D),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUOrigin3D>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUOrigin3D),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUOrigin3D>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUOrigin3D),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUPipelineLayoutDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub bindGroupLayoutCount: u32,
    pub bindGroupLayouts: *const WGPUBindGroupLayout,
}
#[test]
fn bindgen_test_layout_WGPUPipelineLayoutDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUPipelineLayoutDescriptor>(),
        32usize,
        concat!("Size of: ", stringify!(WGPUPipelineLayoutDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUPipelineLayoutDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUPipelineLayoutDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUPipelineLayoutDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUPipelineLayoutDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUPipelineLayoutDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUPipelineLayoutDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUPipelineLayoutDescriptor>())).bindGroupLayoutCount
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUPipelineLayoutDescriptor),
            "::",
            stringify!(bindGroupLayoutCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUPipelineLayoutDescriptor>())).bindGroupLayouts as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUPipelineLayoutDescriptor),
            "::",
            stringify!(bindGroupLayouts)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUProgrammableStageDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub module: WGPUShaderModule,
    pub entryPoint: *const libc::c_char,
}
#[test]
fn bindgen_test_layout_WGPUProgrammableStageDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUProgrammableStageDescriptor>(),
        24usize,
        concat!("Size of: ", stringify!(WGPUProgrammableStageDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUProgrammableStageDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUProgrammableStageDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUProgrammableStageDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUProgrammableStageDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUProgrammableStageDescriptor>())).module as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUProgrammableStageDescriptor),
            "::",
            stringify!(module)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUProgrammableStageDescriptor>())).entryPoint as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUProgrammableStageDescriptor),
            "::",
            stringify!(entryPoint)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURasterizationStateDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub frontFace: WGPUFrontFace,
    pub cullMode: WGPUCullMode,
    pub depthBias: i32,
    pub depthBiasSlopeScale: f32,
    pub depthBiasClamp: f32,
}
#[test]
fn bindgen_test_layout_WGPURasterizationStateDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPURasterizationStateDescriptor>(),
        32usize,
        concat!("Size of: ", stringify!(WGPURasterizationStateDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPURasterizationStateDescriptor>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPURasterizationStateDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURasterizationStateDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURasterizationStateDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURasterizationStateDescriptor>())).frontFace as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURasterizationStateDescriptor),
            "::",
            stringify!(frontFace)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURasterizationStateDescriptor>())).cullMode as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURasterizationStateDescriptor),
            "::",
            stringify!(cullMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURasterizationStateDescriptor>())).depthBias as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURasterizationStateDescriptor),
            "::",
            stringify!(depthBias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURasterizationStateDescriptor>())).depthBiasSlopeScale
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURasterizationStateDescriptor),
            "::",
            stringify!(depthBiasSlopeScale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURasterizationStateDescriptor>())).depthBiasClamp as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURasterizationStateDescriptor),
            "::",
            stringify!(depthBiasClamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderBundleDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
}
#[test]
fn bindgen_test_layout_WGPURenderBundleDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPURenderBundleDescriptor>(),
        16usize,
        concat!("Size of: ", stringify!(WGPURenderBundleDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPURenderBundleDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPURenderBundleDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderBundleDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderBundleDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderBundleDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderBundleDescriptor),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderBundleEncoderDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub colorFormatsCount: u32,
    pub colorFormats: *const WGPUTextureFormat,
    pub depthStencilFormat: WGPUTextureFormat,
    pub sampleCount: u32,
}
#[test]
fn bindgen_test_layout_WGPURenderBundleEncoderDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPURenderBundleEncoderDescriptor>(),
        40usize,
        concat!("Size of: ", stringify!(WGPURenderBundleEncoderDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPURenderBundleEncoderDescriptor>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPURenderBundleEncoderDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderBundleEncoderDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderBundleEncoderDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderBundleEncoderDescriptor>())).label as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderBundleEncoderDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderBundleEncoderDescriptor>())).colorFormatsCount
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderBundleEncoderDescriptor),
            "::",
            stringify!(colorFormatsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderBundleEncoderDescriptor>())).colorFormats as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderBundleEncoderDescriptor),
            "::",
            stringify!(colorFormats)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderBundleEncoderDescriptor>())).depthStencilFormat
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderBundleEncoderDescriptor),
            "::",
            stringify!(depthStencilFormat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderBundleEncoderDescriptor>())).sampleCount as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderBundleEncoderDescriptor),
            "::",
            stringify!(sampleCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassDepthStencilAttachmentDescriptor {
    pub attachment: WGPUTextureView,
    pub depthLoadOp: WGPULoadOp,
    pub depthStoreOp: WGPUStoreOp,
    pub clearDepth: f32,
    pub stencilLoadOp: WGPULoadOp,
    pub stencilStoreOp: WGPUStoreOp,
    pub clearStencil: u32,
}
#[test]
fn bindgen_test_layout_WGPURenderPassDepthStencilAttachmentDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPURenderPassDepthStencilAttachmentDescriptor>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<WGPURenderPassDepthStencilAttachmentDescriptor>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDepthStencilAttachmentDescriptor>())).attachment
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor),
            "::",
            stringify!(attachment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDepthStencilAttachmentDescriptor>())).depthLoadOp
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor),
            "::",
            stringify!(depthLoadOp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDepthStencilAttachmentDescriptor>())).depthStoreOp
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor),
            "::",
            stringify!(depthStoreOp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDepthStencilAttachmentDescriptor>())).clearDepth
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor),
            "::",
            stringify!(clearDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDepthStencilAttachmentDescriptor>()))
                .stencilLoadOp as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor),
            "::",
            stringify!(stencilLoadOp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDepthStencilAttachmentDescriptor>()))
                .stencilStoreOp as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor),
            "::",
            stringify!(stencilStoreOp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDepthStencilAttachmentDescriptor>())).clearStencil
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDepthStencilAttachmentDescriptor),
            "::",
            stringify!(clearStencil)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSamplerDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub addressModeU: WGPUAddressMode,
    pub addressModeV: WGPUAddressMode,
    pub addressModeW: WGPUAddressMode,
    pub magFilter: WGPUFilterMode,
    pub minFilter: WGPUFilterMode,
    pub mipmapFilter: WGPUFilterMode,
    pub lodMinClamp: f32,
    pub lodMaxClamp: f32,
    pub compare: WGPUCompareFunction,
}
#[test]
fn bindgen_test_layout_WGPUSamplerDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUSamplerDescriptor>(),
        56usize,
        concat!("Size of: ", stringify!(WGPUSamplerDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUSamplerDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUSamplerDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).addressModeU as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(addressModeU)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).addressModeV as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(addressModeV)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).addressModeW as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(addressModeW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).magFilter as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(magFilter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).minFilter as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(minFilter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).mipmapFilter as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(mipmapFilter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).lodMinClamp as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(lodMinClamp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).lodMaxClamp as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(lodMaxClamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUSamplerDescriptor>())).compare as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptor),
            "::",
            stringify!(compare)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSamplerDescriptorDummyAnisotropicFiltering {
    pub chain: WGPUChainedStruct,
    pub maxAnisotropy: f32,
}
#[test]
fn bindgen_test_layout_WGPUSamplerDescriptorDummyAnisotropicFiltering() {
    assert_eq!(
        ::core::mem::size_of::<WGPUSamplerDescriptorDummyAnisotropicFiltering>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(WGPUSamplerDescriptorDummyAnisotropicFiltering)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUSamplerDescriptorDummyAnisotropicFiltering>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPUSamplerDescriptorDummyAnisotropicFiltering)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptorDummyAnisotropicFiltering>())).chain
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptorDummyAnisotropicFiltering),
            "::",
            stringify!(chain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSamplerDescriptorDummyAnisotropicFiltering>()))
                .maxAnisotropy as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSamplerDescriptorDummyAnisotropicFiltering),
            "::",
            stringify!(maxAnisotropy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUShaderModuleDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub codeSize: u32,
    pub code: *const u32,
}
#[test]
fn bindgen_test_layout_WGPUShaderModuleDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUShaderModuleDescriptor>(),
        32usize,
        concat!("Size of: ", stringify!(WGPUShaderModuleDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUShaderModuleDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUShaderModuleDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUShaderModuleDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUShaderModuleDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUShaderModuleDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUShaderModuleDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUShaderModuleDescriptor>())).codeSize as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUShaderModuleDescriptor),
            "::",
            stringify!(codeSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUShaderModuleDescriptor>())).code as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUShaderModuleDescriptor),
            "::",
            stringify!(code)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUStencilStateFaceDescriptor {
    pub compare: WGPUCompareFunction,
    pub failOp: WGPUStencilOperation,
    pub depthFailOp: WGPUStencilOperation,
    pub passOp: WGPUStencilOperation,
}
#[test]
fn bindgen_test_layout_WGPUStencilStateFaceDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUStencilStateFaceDescriptor>(),
        16usize,
        concat!("Size of: ", stringify!(WGPUStencilStateFaceDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUStencilStateFaceDescriptor>(),
        4usize,
        concat!("Alignment of ", stringify!(WGPUStencilStateFaceDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUStencilStateFaceDescriptor>())).compare as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUStencilStateFaceDescriptor),
            "::",
            stringify!(compare)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUStencilStateFaceDescriptor>())).failOp as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUStencilStateFaceDescriptor),
            "::",
            stringify!(failOp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUStencilStateFaceDescriptor>())).depthFailOp as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUStencilStateFaceDescriptor),
            "::",
            stringify!(depthFailOp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUStencilStateFaceDescriptor>())).passOp as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUStencilStateFaceDescriptor),
            "::",
            stringify!(passOp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
}
#[test]
fn bindgen_test_layout_WGPUSurfaceDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUSurfaceDescriptor>(),
        16usize,
        concat!("Size of: ", stringify!(WGPUSurfaceDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUSurfaceDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUSurfaceDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUSurfaceDescriptor>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptor),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptorFromHTMLCanvasId {
    pub chain: WGPUChainedStruct,
    pub id: *const libc::c_char,
}
#[test]
fn bindgen_test_layout_WGPUSurfaceDescriptorFromHTMLCanvasId() {
    assert_eq!(
        ::core::mem::size_of::<WGPUSurfaceDescriptorFromHTMLCanvasId>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(WGPUSurfaceDescriptorFromHTMLCanvasId)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUSurfaceDescriptorFromHTMLCanvasId>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPUSurfaceDescriptorFromHTMLCanvasId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromHTMLCanvasId>())).chain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromHTMLCanvasId),
            "::",
            stringify!(chain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromHTMLCanvasId>())).id as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromHTMLCanvasId),
            "::",
            stringify!(id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptorFromMetalLayer {
    pub chain: WGPUChainedStruct,
    pub layer: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_WGPUSurfaceDescriptorFromMetalLayer() {
    assert_eq!(
        ::core::mem::size_of::<WGPUSurfaceDescriptorFromMetalLayer>(),
        24usize,
        concat!("Size of: ", stringify!(WGPUSurfaceDescriptorFromMetalLayer))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUSurfaceDescriptorFromMetalLayer>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPUSurfaceDescriptorFromMetalLayer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromMetalLayer>())).chain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromMetalLayer),
            "::",
            stringify!(chain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromMetalLayer>())).layer as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromMetalLayer),
            "::",
            stringify!(layer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptorFromWindowsHWND {
    pub chain: WGPUChainedStruct,
    pub hinstance: *mut libc::c_void,
    pub hwnd: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_WGPUSurfaceDescriptorFromWindowsHWND() {
    assert_eq!(
        ::core::mem::size_of::<WGPUSurfaceDescriptorFromWindowsHWND>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(WGPUSurfaceDescriptorFromWindowsHWND)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUSurfaceDescriptorFromWindowsHWND>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPUSurfaceDescriptorFromWindowsHWND)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromWindowsHWND>())).chain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromWindowsHWND),
            "::",
            stringify!(chain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromWindowsHWND>())).hinstance as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromWindowsHWND),
            "::",
            stringify!(hinstance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromWindowsHWND>())).hwnd as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromWindowsHWND),
            "::",
            stringify!(hwnd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSurfaceDescriptorFromXlib {
    pub chain: WGPUChainedStruct,
    pub display: *mut libc::c_void,
    pub window: u32,
}
#[test]
fn bindgen_test_layout_WGPUSurfaceDescriptorFromXlib() {
    assert_eq!(
        ::core::mem::size_of::<WGPUSurfaceDescriptorFromXlib>(),
        32usize,
        concat!("Size of: ", stringify!(WGPUSurfaceDescriptorFromXlib))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUSurfaceDescriptorFromXlib>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUSurfaceDescriptorFromXlib))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromXlib>())).chain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromXlib),
            "::",
            stringify!(chain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromXlib>())).display as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromXlib),
            "::",
            stringify!(display)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSurfaceDescriptorFromXlib>())).window as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSurfaceDescriptorFromXlib),
            "::",
            stringify!(window)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUSwapChainDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub usage: WGPUTextureUsageFlags,
    pub format: WGPUTextureFormat,
    pub width: u32,
    pub height: u32,
    pub presentMode: WGPUPresentMode,
    pub implementation: u64,
}
#[test]
fn bindgen_test_layout_WGPUSwapChainDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUSwapChainDescriptor>(),
        48usize,
        concat!("Size of: ", stringify!(WGPUSwapChainDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUSwapChainDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUSwapChainDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSwapChainDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSwapChainDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUSwapChainDescriptor>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSwapChainDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUSwapChainDescriptor>())).usage as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSwapChainDescriptor),
            "::",
            stringify!(usage)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUSwapChainDescriptor>())).format as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSwapChainDescriptor),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUSwapChainDescriptor>())).width as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSwapChainDescriptor),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUSwapChainDescriptor>())).height as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSwapChainDescriptor),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSwapChainDescriptor>())).presentMode as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSwapChainDescriptor),
            "::",
            stringify!(presentMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUSwapChainDescriptor>())).implementation as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUSwapChainDescriptor),
            "::",
            stringify!(implementation)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureViewDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub format: WGPUTextureFormat,
    pub dimension: WGPUTextureViewDimension,
    pub baseMipLevel: u32,
    pub mipLevelCount: u32,
    pub baseArrayLayer: u32,
    pub arrayLayerCount: u32,
    pub aspect: WGPUTextureAspect,
}
#[test]
fn bindgen_test_layout_WGPUTextureViewDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUTextureViewDescriptor>(),
        48usize,
        concat!("Size of: ", stringify!(WGPUTextureViewDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUTextureViewDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUTextureViewDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).format as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).dimension as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).baseMipLevel as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(baseMipLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).mipLevelCount as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(mipLevelCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).baseArrayLayer as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(baseArrayLayer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).arrayLayerCount as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(arrayLayerCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureViewDescriptor>())).aspect as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureViewDescriptor),
            "::",
            stringify!(aspect)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUVertexAttributeDescriptor {
    pub format: WGPUVertexFormat,
    pub offset: u64,
    pub shaderLocation: u32,
}
#[test]
fn bindgen_test_layout_WGPUVertexAttributeDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUVertexAttributeDescriptor>(),
        24usize,
        concat!("Size of: ", stringify!(WGPUVertexAttributeDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUVertexAttributeDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUVertexAttributeDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexAttributeDescriptor>())).format as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexAttributeDescriptor),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexAttributeDescriptor>())).offset as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexAttributeDescriptor),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexAttributeDescriptor>())).shaderLocation as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexAttributeDescriptor),
            "::",
            stringify!(shaderLocation)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub layout: WGPUBindGroupLayout,
    pub bindingCount: u32,
    pub bindings: *const WGPUBindGroupEntry,
}
#[test]
fn bindgen_test_layout_WGPUBindGroupDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUBindGroupDescriptor>(),
        40usize,
        concat!("Size of: ", stringify!(WGPUBindGroupDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUBindGroupDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUBindGroupDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupDescriptor>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUBindGroupDescriptor>())).layout as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupDescriptor),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupDescriptor>())).bindingCount as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupDescriptor),
            "::",
            stringify!(bindingCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupDescriptor>())).bindings as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupDescriptor),
            "::",
            stringify!(bindings)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUBindGroupLayoutDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub bindingCount: u32,
    pub bindings: *const WGPUBindGroupLayoutEntry,
}
#[test]
fn bindgen_test_layout_WGPUBindGroupLayoutDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUBindGroupLayoutDescriptor>(),
        32usize,
        concat!("Size of: ", stringify!(WGPUBindGroupLayoutDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUBindGroupLayoutDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUBindGroupLayoutDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutDescriptor>())).bindingCount as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutDescriptor),
            "::",
            stringify!(bindingCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUBindGroupLayoutDescriptor>())).bindings as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUBindGroupLayoutDescriptor),
            "::",
            stringify!(bindings)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUColorStateDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub format: WGPUTextureFormat,
    pub alphaBlend: WGPUBlendDescriptor,
    pub colorBlend: WGPUBlendDescriptor,
    pub writeMask: WGPUColorWriteMaskFlags,
}
#[test]
fn bindgen_test_layout_WGPUColorStateDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUColorStateDescriptor>(),
        40usize,
        concat!("Size of: ", stringify!(WGPUColorStateDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUColorStateDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUColorStateDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUColorStateDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColorStateDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUColorStateDescriptor>())).format as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColorStateDescriptor),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUColorStateDescriptor>())).alphaBlend as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColorStateDescriptor),
            "::",
            stringify!(alphaBlend)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUColorStateDescriptor>())).colorBlend as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColorStateDescriptor),
            "::",
            stringify!(colorBlend)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUColorStateDescriptor>())).writeMask as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUColorStateDescriptor),
            "::",
            stringify!(writeMask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUComputePipelineDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub layout: WGPUPipelineLayout,
    pub computeStage: WGPUProgrammableStageDescriptor,
}
#[test]
fn bindgen_test_layout_WGPUComputePipelineDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUComputePipelineDescriptor>(),
        48usize,
        concat!("Size of: ", stringify!(WGPUComputePipelineDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUComputePipelineDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUComputePipelineDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUComputePipelineDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUComputePipelineDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUComputePipelineDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUComputePipelineDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUComputePipelineDescriptor>())).layout as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUComputePipelineDescriptor),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUComputePipelineDescriptor>())).computeStage as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUComputePipelineDescriptor),
            "::",
            stringify!(computeStage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUDepthStencilStateDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub format: WGPUTextureFormat,
    pub depthWriteEnabled: bool,
    pub depthCompare: WGPUCompareFunction,
    pub stencilFront: WGPUStencilStateFaceDescriptor,
    pub stencilBack: WGPUStencilStateFaceDescriptor,
    pub stencilReadMask: u32,
    pub stencilWriteMask: u32,
}
#[test]
fn bindgen_test_layout_WGPUDepthStencilStateDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUDepthStencilStateDescriptor>(),
        64usize,
        concat!("Size of: ", stringify!(WGPUDepthStencilStateDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUDepthStencilStateDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUDepthStencilStateDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDepthStencilStateDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDepthStencilStateDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDepthStencilStateDescriptor>())).format as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDepthStencilStateDescriptor),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDepthStencilStateDescriptor>())).depthWriteEnabled
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDepthStencilStateDescriptor),
            "::",
            stringify!(depthWriteEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDepthStencilStateDescriptor>())).depthCompare as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDepthStencilStateDescriptor),
            "::",
            stringify!(depthCompare)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDepthStencilStateDescriptor>())).stencilFront as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDepthStencilStateDescriptor),
            "::",
            stringify!(stencilFront)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDepthStencilStateDescriptor>())).stencilBack as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDepthStencilStateDescriptor),
            "::",
            stringify!(stencilBack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDepthStencilStateDescriptor>())).stencilReadMask as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDepthStencilStateDescriptor),
            "::",
            stringify!(stencilReadMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUDepthStencilStateDescriptor>())).stencilWriteMask
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUDepthStencilStateDescriptor),
            "::",
            stringify!(stencilWriteMask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassColorAttachmentDescriptor {
    pub attachment: WGPUTextureView,
    pub resolveTarget: WGPUTextureView,
    pub loadOp: WGPULoadOp,
    pub storeOp: WGPUStoreOp,
    pub clearColor: WGPUColor,
}
#[test]
fn bindgen_test_layout_WGPURenderPassColorAttachmentDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPURenderPassColorAttachmentDescriptor>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(WGPURenderPassColorAttachmentDescriptor)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<WGPURenderPassColorAttachmentDescriptor>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPURenderPassColorAttachmentDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassColorAttachmentDescriptor>())).attachment
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassColorAttachmentDescriptor),
            "::",
            stringify!(attachment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassColorAttachmentDescriptor>())).resolveTarget
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassColorAttachmentDescriptor),
            "::",
            stringify!(resolveTarget)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassColorAttachmentDescriptor>())).loadOp as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassColorAttachmentDescriptor),
            "::",
            stringify!(loadOp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassColorAttachmentDescriptor>())).storeOp as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassColorAttachmentDescriptor),
            "::",
            stringify!(storeOp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassColorAttachmentDescriptor>())).clearColor
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassColorAttachmentDescriptor),
            "::",
            stringify!(clearColor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPipelineDescriptorDummyExtension {
    pub chain: WGPUChainedStruct,
    pub dummyStage: WGPUProgrammableStageDescriptor,
}
#[test]
fn bindgen_test_layout_WGPURenderPipelineDescriptorDummyExtension() {
    assert_eq!(
        ::core::mem::size_of::<WGPURenderPipelineDescriptorDummyExtension>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(WGPURenderPipelineDescriptorDummyExtension)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<WGPURenderPipelineDescriptorDummyExtension>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPURenderPipelineDescriptorDummyExtension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptorDummyExtension>())).chain
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptorDummyExtension),
            "::",
            stringify!(chain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptorDummyExtension>())).dummyStage
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptorDummyExtension),
            "::",
            stringify!(dummyStage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureCopyView {
    pub nextInChain: *const WGPUChainedStruct,
    pub texture: WGPUTexture,
    pub mipLevel: u32,
    pub arrayLayer: u32,
    pub origin: WGPUOrigin3D,
}
#[test]
fn bindgen_test_layout_WGPUTextureCopyView() {
    assert_eq!(
        ::core::mem::size_of::<WGPUTextureCopyView>(),
        40usize,
        concat!("Size of: ", stringify!(WGPUTextureCopyView))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUTextureCopyView>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUTextureCopyView))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureCopyView>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureCopyView),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUTextureCopyView>())).texture as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureCopyView),
            "::",
            stringify!(texture)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUTextureCopyView>())).mipLevel as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureCopyView),
            "::",
            stringify!(mipLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUTextureCopyView>())).arrayLayer as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureCopyView),
            "::",
            stringify!(arrayLayer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUTextureCopyView>())).origin as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureCopyView),
            "::",
            stringify!(origin)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUTextureDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub usage: WGPUTextureUsageFlags,
    pub dimension: WGPUTextureDimension,
    pub size: WGPUExtent3D,
    pub arrayLayerCount: u32,
    pub format: WGPUTextureFormat,
    pub mipLevelCount: u32,
    pub sampleCount: u32,
}
#[test]
fn bindgen_test_layout_WGPUTextureDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUTextureDescriptor>(),
        56usize,
        concat!("Size of: ", stringify!(WGPUTextureDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUTextureDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUTextureDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUTextureDescriptor>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUTextureDescriptor>())).usage as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(usage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureDescriptor>())).dimension as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(dimension)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUTextureDescriptor>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureDescriptor>())).arrayLayerCount as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(arrayLayerCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPUTextureDescriptor>())).format as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureDescriptor>())).mipLevelCount as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(mipLevelCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUTextureDescriptor>())).sampleCount as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUTextureDescriptor),
            "::",
            stringify!(sampleCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUVertexBufferLayoutDescriptor {
    pub arrayStride: u64,
    pub stepMode: WGPUInputStepMode,
    pub attributeCount: u32,
    pub attributes: *const WGPUVertexAttributeDescriptor,
}
#[test]
fn bindgen_test_layout_WGPUVertexBufferLayoutDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUVertexBufferLayoutDescriptor>(),
        24usize,
        concat!("Size of: ", stringify!(WGPUVertexBufferLayoutDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUVertexBufferLayoutDescriptor>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(WGPUVertexBufferLayoutDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexBufferLayoutDescriptor>())).arrayStride as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexBufferLayoutDescriptor),
            "::",
            stringify!(arrayStride)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexBufferLayoutDescriptor>())).stepMode as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexBufferLayoutDescriptor),
            "::",
            stringify!(stepMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexBufferLayoutDescriptor>())).attributeCount as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexBufferLayoutDescriptor),
            "::",
            stringify!(attributeCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexBufferLayoutDescriptor>())).attributes as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexBufferLayoutDescriptor),
            "::",
            stringify!(attributes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPassDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub colorAttachmentCount: u32,
    pub colorAttachments: *const WGPURenderPassColorAttachmentDescriptor,
    pub depthStencilAttachment: *const WGPURenderPassDepthStencilAttachmentDescriptor,
}
#[test]
fn bindgen_test_layout_WGPURenderPassDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPURenderPassDescriptor>(),
        40usize,
        concat!("Size of: ", stringify!(WGPURenderPassDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPURenderPassDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPURenderPassDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WGPURenderPassDescriptor>())).label as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDescriptor>())).colorAttachmentCount as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDescriptor),
            "::",
            stringify!(colorAttachmentCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDescriptor>())).colorAttachments as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDescriptor),
            "::",
            stringify!(colorAttachments)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPassDescriptor>())).depthStencilAttachment as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPassDescriptor),
            "::",
            stringify!(depthStencilAttachment)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPUVertexStateDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub indexFormat: WGPUIndexFormat,
    pub vertexBufferCount: u32,
    pub vertexBuffers: *const WGPUVertexBufferLayoutDescriptor,
}
#[test]
fn bindgen_test_layout_WGPUVertexStateDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPUVertexStateDescriptor>(),
        24usize,
        concat!("Size of: ", stringify!(WGPUVertexStateDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPUVertexStateDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPUVertexStateDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexStateDescriptor>())).nextInChain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexStateDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexStateDescriptor>())).indexFormat as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexStateDescriptor),
            "::",
            stringify!(indexFormat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexStateDescriptor>())).vertexBufferCount as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexStateDescriptor),
            "::",
            stringify!(vertexBufferCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPUVertexStateDescriptor>())).vertexBuffers as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPUVertexStateDescriptor),
            "::",
            stringify!(vertexBuffers)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WGPURenderPipelineDescriptor {
    pub nextInChain: *const WGPUChainedStruct,
    pub label: *const libc::c_char,
    pub layout: WGPUPipelineLayout,
    pub vertexStage: WGPUProgrammableStageDescriptor,
    pub fragmentStage: *const WGPUProgrammableStageDescriptor,
    pub vertexState: *const WGPUVertexStateDescriptor,
    pub primitiveTopology: WGPUPrimitiveTopology,
    pub rasterizationState: *const WGPURasterizationStateDescriptor,
    pub sampleCount: u32,
    pub depthStencilState: *const WGPUDepthStencilStateDescriptor,
    pub colorStateCount: u32,
    pub colorStates: *const WGPUColorStateDescriptor,
    pub sampleMask: u32,
    pub alphaToCoverageEnabled: bool,
}
#[test]
fn bindgen_test_layout_WGPURenderPipelineDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<WGPURenderPipelineDescriptor>(),
        120usize,
        concat!("Size of: ", stringify!(WGPURenderPipelineDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<WGPURenderPipelineDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WGPURenderPipelineDescriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).nextInChain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(nextInChain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).label as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).layout as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).vertexStage as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(vertexStage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).fragmentStage as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(fragmentStage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).vertexState as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(vertexState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).primitiveTopology as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(primitiveTopology)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).rasterizationState as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(rasterizationState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).sampleCount as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(sampleCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).depthStencilState as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(depthStencilState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).colorStateCount as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(colorStateCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).colorStates as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(colorStates)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).sampleMask as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(sampleMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<WGPURenderPipelineDescriptor>())).alphaToCoverageEnabled
                as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(WGPURenderPipelineDescriptor),
            "::",
            stringify!(alphaToCoverageEnabled)
        )
    );
}
pub type WGPUBindGroupBinding = WGPUBindGroupEntry;
pub type WGPUBindGroupLayoutBinding = WGPUBindGroupLayoutEntry;
pub type WGPUBufferCreateMappedCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUBufferMapAsyncStatus,
        result: WGPUCreateBufferMappedResult,
        userdata: *mut libc::c_void,
    ),
>;
pub type WGPUBufferMapReadCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUBufferMapAsyncStatus,
        data: *const libc::c_void,
        dataLength: u64,
        userdata: *mut libc::c_void,
    ),
>;
pub type WGPUBufferMapWriteCallback = ::core::option::Option<
    unsafe extern "C" fn(
        status: WGPUBufferMapAsyncStatus,
        data: *mut libc::c_void,
        dataLength: u64,
        userdata: *mut libc::c_void,
    ),
>;
